# Add Repogitory
tap 'homebrew/bundle'
tap 'caskroom/homebrew-cask'
tap 'caskroom/homebrew-versions'
tap 'caskroom/fonts'

# Install Packages
## brew-cask
brew 'brew-cask'

## shell
brew 'git'
brew 'zsh'

## package manager
brew 'nodebrew'
brew 'rbenv'
brew 'ruby-build'

## Other
brew 'tree'
brew 'sl'

# Install Mac App

## browser
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'firefox-ja'

## communicate
cask 'skype'
cask 'caprine'

## design
cask 'sketch-toolbox'

## develop
cask 'virtualbox'
cask 'vagrant'
cask 'sequel-pro'
cask 'mongohub'
cask 'heroku-toolbelt'
cask 'cyberduck'

## editor
cask 'iterm2'
cask 'sublime-text3'
cask 'github-desktop'

## hobby
cask 'spotify'
cask 'minecraft'

## utility
cask 'google-japanese-ime'
cask 'appcleaner'
cask 'dropbox'
cask 'karabiner'
cask 'macs-fan-control'

# Install fonts
cask 'font-source-code-pro'
